<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>EstadoInicial</title><link href="ocean.css" rel="stylesheet" type="text/css" title="Ocean" /><script src="haddock-util.js" type="text/javascript"></script><script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML" type="text/javascript"></script><script type="text/javascript">//<![CDATA[
window.onload = function () {pageLoad();setSynopsis("mini_EstadoInicial.html");};
//]]>
</script></head><body><div id="package-header"><ul class="links" id="page-menu"><li><a href="index.html">Contents</a></li><li><a href="doc-index.html">Index</a></li></ul><p class="caption empty">&nbsp;</p></div><div id="content"><div id="module-header"><table class="info"><tr><th valign="top">Copyright</th><td>Jos&#233; Pedro Silva &lt;a84577@uminho.pt&gt;<br />Rui Carvalho &lt;a89498@uminho.pt&gt;</td></tr><tr><th>Safe Haskell</th><td>None</td></tr></table><p class="caption">EstadoInicial</p></div><div id="description"><p class="caption">Description</p><div class="doc"><p>M&#243;dulo da tarefa 5 que cont&#233;m o estado inicial do <code><a href="Typos.html#t:EstadoGloss">EstadoGloss</a></code> definido no ficheiro <code><a href="Typos.html#v:hs">hs</a></code>.</p></div></div><div id="synopsis"><p id="control.syn" class="caption expander" onclick="toggleSection('syn')">Synopsis</p><ul id="section.syn" class="hide" onclick="toggleSection('syn')"><li class="src short"><a href="#v:estadoI">estadoI</a> :: <a href="Typos.html#t:Imagens">Imagens</a> -&gt; <a href="Typos.html#t:EstadoGloss">EstadoGloss</a></li></ul></div><div id="interface"><h1>Documentation</h1><div class="top"><p class="src"><a id="v:estadoI" class="def">estadoI</a> :: <a href="Typos.html#t:Imagens">Imagens</a> -&gt; <a href="Typos.html#t:EstadoGloss">EstadoGloss</a> <a href="#v:estadoI" class="selflink">#</a></p><div class="doc"><p>Fun&#231;&#227;o que define os valores iniciais dos parametros do <code><a href="Typos.html#t:EstadoGloss">EstadoGloss</a></code>
estado: O estado &#233; definido inicialmente com um mapa de dimens&#227;o (6,6), a lista de jogadores &#233; vazia e a lista de disparos vazia.</p><pre>  * <strong>editor</strong>: O editor usado no construtor de mapas &#233; definido pelo editor inicial no qual se aplica a func&#227;o desenha para que o tetromino inicial seja apresentado no ecr&#227;.

  * <strong>menu</strong>: Inicialmente o valor l&#243;gico do par&#226;metro menu &#233; colocado a <code>True</code> pois o jogo come&#231;a no menu inicial.

  * <strong>nJog</strong>: O n&#250;mero de jogadores inicialmente &#233; 0.

  * <strong>tMenu</strong>: Inicialmente o tipo de menu (tMenu) &#233; a primeira imagem da lista das <code><a href="Typos.html#v:imagensMenu">imagensMenu</a></code>, par&#226;metro de <code><a href="Typos.html#t:Imagens">Imagens</a></code> passada para a fun&#231;&#227;o <em>EditorInicial</em>.

  * <strong>acoesMapa</strong>: A lista de a&#231;&#245;es (<em>instru&#231;&#245;es</em>) usadas no criador de mapas, inicialmente, &#233; <code>vazia</code>.

  * <strong>criaMapa</strong>: Primeiramente este valor &#233; colocado a <code>Falso</code>, pois o criador de mapas &#233; algo que &#233; ativado atrav&#233;s do menu.

  * <strong>powerups</strong>: A lista dos powerups &#233; vazia. &#193; medida que eles s&#227;o gerados v&#227;o sendo acrescentados a esta lista.

  * <strong>powerUpCounter</strong>: Contador usado para saber quantos powerups existem no <code><a href="LI11819.html#t:Mapa">Mapa</a></code> e em que <code><a href="LI11819.html#t:Posicao">Posicao</a></code>.

  * <strong>rnd</strong>: Semente usada para gerar n&#250;meros aleat&#243;rios, &#233; atualizada cada vez que se gera um n&#250;mero aleat&#243;rio.

  * <strong>empty</strong>: Lista que guarda as <code><a href="LI11819.html#t:Posicao">Posicao</a></code> para qual o jogador se pode mover quando usar o <code>PowerUpTeleport</code>.

  * <strong>tickCounter</strong>: Inicialmente este valor &#233; colocado a 0. Este valor &#233; usado para desenhar os ticks no ecr&#227;.

  * <strong>windowSize</strong>: A resolu&#231;&#227;o inicial &#233; igual &#224; dimens&#227;o do display inicial. Este par&#226;metro &#233; usado na fun&#231;&#227;o <code>verifyWindowSize</code> para impedir o resize de certos elementos no ecr&#227;
                como por exemplo as imagens dos estados dos jogadores como forma de evitar a sopresi&#231;&#227;o de algumas imagens impedindo erros visuais.

  * <strong>botIndex</strong>: A lista de bots inicial &#233; vazia. Ap&#243;s a escolha da quantidade de jogadores num jogo, o indice dos jogadores que s&#227;o bots ser&#227;o colocados neste par&#226;metro. A quantidade de
              bots &#233; definida pela diferen&#231;a entre 4 e a quantidade de tanques jog&#225;veis escolhida pelo utilizador.

  * <strong>winner</strong>: Este valor &#233; definido como -1 sendo que quando um jogador ganha, este &#233; substituido pelo indice do tanque vencedor (&#250;nico sobrevivente). A fun&#231;&#227;o <code>ReageTempo</code> verifica se
            h&#225; vencedor e coloca neste par&#226;metro o indice do vencedor.
  </pre></div></div></div></div><div id="footer"><p>Produced by <a href="http://www.haskell.org/haddock/">Haddock</a> version 2.17.3</p></div></body></html>